# NewDoubleArray Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewDoubleArray Method
Application Class See Also
---
Creates a new instance of a double array.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DoubleArray NewDoubleArray()
```

Visual Basic
---
```text
Public Function NewDoubleArray As DoubleArray
```

Visual C++
---
```text
public:
DoubleArray^ NewDoubleArray()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace